<a href="https://colab.research.google.com/github/almasmogaka/Node-MySQL-Rest-API-Passport-JWT/blob/master/Practice_Notebook_Ataraa_Data_Science_Data_Cleaning_with_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Cleaning with Python

## 1. Standardisation

#### <font color="blue">Pre-requisites</font>

In [0]:
# Pre-requisite 1
# ---
# Importing pandas library
# ---
# -> This is a data analysis and manipulation library with Python.
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [0]:
# Pre-requisite 2
# ---
# Importing the numpy library
# -> This is a library for scientific computing with Python.
# -> It simply allows us to perfom complex mathematical operations.
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our dataset from the url
# ---
# We also specify the character ; as our separator
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Example 1a
# --- 
# Renaming our columns, if we have many column names.
# We use the str.strip(), str.lower(), str.replace() functions
# ---
#
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Example 1b
# ---
# Renaming the column names manually
# ---
#

# Reloading our dataset again for this example 
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';') 

# Specifying our columns names
# ---
# 
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# String conversion: Convert city column to lower case
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Converting the city column to lowercase 
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# Metric conversion: Height inches to cm
# Hint: 1 inch = 2.54 cm
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

df['height'] = df['height'] * 2.54
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

In [0]:
# Determining the datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [0]:
# Performing our conversion
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Confirming our conversion
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Rename the columns in the following dataset.
# ---
# Dataset url = http://bit.ly/GVProjectsFunding
# ---
# OUR CODE GOES BELOW
#

gv_df = pd.read_csv('http://bit.ly/GVProjectsFunding')
gv_df.head()

   Total_-_GOK_Budget_Est_KES  ...  OBJECTID
0                   111285239  ...         0
1                  2009277440  ...         1
2                    50034000  ...         2
3                 24267555932  ...         3
4                  1160000000  ...         4

[5 rows x 7 columns]

In [0]:
gv_df.columns = gv_df.columns.str.strip().str.lower().str.replace(' ', '_')
gv_df.head()

   total_-_gok_budget_est_kes  ...  objectid
0                   111285239  ...         0
1                  2009277440  ...         1
2                    50034000  ...         2
3                 24267555932  ...         3
4                  1160000000  ...         4

[5 rows x 7 columns]

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2
# ---
# Question: Convert the given weight in the dataset from pounds to kgs. 
# Hint: 1 pound = 0.453592 kgs
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 3</font>

In [0]:
# Challenge 3
# ---
# Question: Convert the variables account_a and account_b to the datatype float
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#

## 2. Syntax Errors

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Spelling mistakes/ Typos
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Replacing "GERMANYY" with "GERMANY"
# ---
# 
df['country'] = df['country'].str.replace('GERMANYY', 'GERMANY')
df.head()

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# White spaces: Stripping the leading and trailing spaces
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Observing leading and trailing spaces in the city column
# ---
# 
df['city']

In [0]:
# Stripping the leading and trailing spaces
# ---
# 
df['city'] = df['city'].str.strip()
df['city']

##### <font color="blue">Example 3</font>

In [0]:
# Example 3 (Optional)
# ---
# Pad Strings: We can also add pad strings as shown when added to the name column.
# Padding refers to addding (whitespaces or other characters) to every string element in the dataframe column.
# Sometime this may note necessarily be useful.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We remove null values to avoid errors while padding
# ---
# 
df.dropna(how ='all', inplace = True) 
  
# We add white spaces to left side 
# ---
# 
df["name"]= df["name"].str.pad(12, side ='right', fillchar ='_') 

# Previewing our resulting dataset
# ---
# 
df.head()

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Fix the spelling errors in the Team variable where it states "oston Celtics" to "Boston Celtics"
# Hint: You can use two steps.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2
# ---
# Question: Deal with the leading and trailing whitespaces from name and Team variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

## 3. Irrelevant Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Deleting irrelevant columns
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Determining the size of our dataset (records, columns)
# ---
# 
df.shape

In [0]:
# Deleting an Irrelevant Column i.e. if we didn't require the column city 
# to answer our research question.
# ---
# 

# Dropping/Deleting those two columns, we also note:
# a) We set axis = 1: A dataframe has two axes: “axis 0” and “axis 1”. 
# “axis 0” represents rows and “axis 1” represents columns.
# b)-> Inplace = True: This would mean the changes would be made in the original dataframe
# ---
# 

# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
df.drop(["city"], axis = 1, inplace = True) 
 
# Previewing our resulting dataset
# ---
# 
df.head()

In [0]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["height", "weight"], axis = 1, inplace = True) 

# Previewing our resulting dataset 
# --- 
# 
df.head()

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# In-record & cross-datasets errors
# -> Such errors result from having two or more values in the same row or across datasets 
# contradicting with each other
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

df['total_account_2'] = df['account_a'] + df['account_b']


# Previewing our resulting dataset 
# ---
#
df.head()

In [0]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['total_account?'] = np.where(df['total_account'] == df['total_account_2'], 'True', 'False')

# Previewing our resulting dataset 
# ---
# 
df.head()

In [0]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['total_account?'] == "False"]

In [0]:
# At this point we can do several things
# -> Correct the values,
# -> Drop/Delete the values,
# -> Or even decide to leave them as they are for certain reasons
# ---
# If we had a large dataset, we could get the no. of records using len(),
# this would help us in our decision making process.
# ---
# 
len(df.loc[df['total_account?'] == "False"])

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: While perfoming some analysis for Project X, we realize that we don't need the team 
# and weight columns in our dataset. Let's drop those two columns below.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2
# ---
# Question: Check for in-record and cross-dataset errors given the following dataset
# Hint: 
# -> Perform other data cleaning techniques that you have learned so far for ease of working.
# -> Total_Budget_Supported__by_Donors_KES = Total_-_Loan_Budget_Est_KES + Total_-_Grant_Budget_Est_KES
# ---
# Dataset url = http://bit.ly/GVProjectsFundingDataset
# ---
# OUR CODE GOES BELOW
#

## 4. Duplicates

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 
 
# Again, determining the shape of our dataset (records/instances, columns/variables)
# ---
# 
df.shape

In [0]:
# We can then identify which observations are duplicates
# through the duplicates function and sum() to know how many
# duplicate records there are.
# In our case we don't have any duplicate records.
# Normally duplicate records are dropped from the dataset.
# ---
#
df = df[~df.duplicated()]

In [0]:
# Finding the no. of duplicates
# ---
# 
sum(df.duplicated())

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function 
# as shown in this example 
# ---
# 
df_duplicates = df.drop_duplicates()

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# Dropping duplicates in a specific column
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
#

# We can also consider records with repeated variables/columns 
# as duplicates and deal with them. For example, we can 
# identify duplicates in our dataset based on country.
# The following records are duplicates
# ---
#  
duplicates_df = df[df.duplicated(['country'])] 
duplicates_df

In [0]:
# Then dropping the duplicates as shown below.
# NB: We will save them in a new dataframe object which will contain our unique dataframe
# --- 
# 
unique_df = df.drop_duplicates(['country'])

# Determining the size of our new dataset 
# We note that the two records were dropped from our original dataset
# ---
# 
unique_df.shape

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Find duplicates in the following dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2
# ---
# Question: Dealing with duplicates in the given dataset
# ---
# Dataset url = http://bit.ly/StaffDataset.
# ---
# OUR CODE GOES BELOW
#

## 5. Missing Data

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Finding records with missing data
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#

In [0]:
# We can check if there is any missing values in the entire dataframe as shown 
# NB: This method may not be the most convenient. Why?
# ---
# 
df.isnull()

In [0]:
# We can also check for missing values in each column 
# NB: This method may not be the most convenient. Why?
# Let's uncomment the following line
# ---
# 
df.isnull().any()

In [0]:
# We can check how many missing values there are across each variable/column by 
# ---
# 
df.isnull().sum()

In [0]:
# We can also check to see if we have any missing values in the dataframe by 
# ---
# 
df.isnull().values.any()

In [0]:
# Lastly, We can also get a total count of missing values by 
#
# ---
df.isnull().sum().sum()

##### <font color="blue">Example 2</font>

In [0]:
# Example 2
# ---
# Dealing with the missing data
# ---
# 

# We can drop rows where all cells in that row is NA
# Let's uncomment the following line
# NB: We don't have these rows in our dataset 
# ---
#
df_cleaned = df.dropna(how='all')
df_cleaned

In [0]:
# We can also drop columns if they only contain missing values
# NB: We don't have these rows in our dataset 
# ---
# 
df_without_columns = df.dropna(axis=1, how='all')
df_without_columns

In [0]:
# We can drop rows that contain less than five observations
# NB: We don't have these rows in our dataset 
# ---
# 
df.dropna(thresh=5)

In [0]:
# Lastly, we can also drop the missing observations
# Let's uncomment the following two lines
# ---
#
df_no_missing = df.dropna()
df_no_missing


# There are many methods of dealing with missing data however, 
# we only dealt with the above basic ones due to time constraints.

##### <font color="blue">Example 3</font>

In [0]:
# Example 3
# ---
# Flag missing values
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We can also fill in missing data with zeros as shown.
# NB: We will create a copy of the original dataframe
# Let's uncomment the following line 
# ---
# 
df2 = df.copy()
df3 = df2.fillna(0)
df3

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Find missing values in the following dataset.
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
#

##### <font color="green">Challenge 2</font>

In [0]:
# Challenge 2
# ---
# Question: Drop the variables with more than 500 missing values
# ---
# Dataset url = http://bit.ly/DCTitanicDataset
# ---
# OUR CODE GOES BELOW
#

## 6. Outliers

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [0]:
# Example 1
# --- 
# Given the following dataset, find and deal with outliers.
# ---
# Dataset url = http://bit.ly/CountryDataset1
# ---
# OUR CODE GOES BELOW
#  

# Let's read data from url as dataframe
# 
outliersc_df = pd.read_csv("http://bit.ly/CountryDataset1") 

# Lets preview our our dataframe below
#
outliersc_df.head()

In [0]:
# Checking the size of our dataset for cleaning purposes
# ---
#
outliersc_df.shape

In [0]:
# There are many ways of dealing with the outliers however in this session we wiil 
# use the interquartile range (IQR). This is the first quartile subtracted from the third quartile, 
# i.e. the range covered by the middle 50% of the data; 
# The first and third quartile can be clearly seen on a box plot on the data above. 
# It is a measure of the dispersion similar to standard deviation or variance, 
# but is much more robust against outliers. Now, calculating IQR for each column.
# 

# Defining our quantiles
# ---
# 
Q1 = outliersc_df.quantile(0.25)
Q3 = outliersc_df.quantile(0.75)
IQR = Q3 - Q1
IQR

# We now filter out outliers . 
# ---
#
outliers_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) |(outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of the dataset with outliers for cleaning purposes
# ---
#
outliers_df_iqr.shape

In [0]:
# To explore our outliers
# ---
# 
outliersc_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) |(outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]
outliersc_df_iqr

In [0]:
# Handling our outliers
# ---
# In our case we will drop them
# ---
# 
clean_dfc_iqr = outliersc_df[~((outliersc_df < (Q1 - 1.5 * IQR)) |(outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]
clean_dfc_iqr.shape

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [0]:
# Challenge 1
# ---
# Question: Find and Deal with the outliers in the given dataset.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#